[{"Benefit": "Highly Nutritious", "Description": "Sweet potatoes are a great source of fiber, vitamins, and minerals.\nOne cup (200 grams) of baked sweet potato with skin provides (2Trusted Source):\nCalories: 180\nCarbs: 41.4 grams\nProtein: 4 grams\nFat: 0.3 grams\nFiber: 6.6 grams\nVitamin A: 769% of the Daily Value (DV)\nVitamin C: 65% of the DV\nManganese: 50% of the DV\nVitamin B6: 29% of the DV\nPotassium: 27% of the DV\nPantothenic acid: 18% of the DV\nCopper: 16% of the DV\nNiacin: 15% of the DV\nIn addition, sweet potatoes — especially the orange and purple varieties — are rich in antioxidants that protect your body from free radicals (3Trusted Source, 4Trusted Source, 5Trusted Source).\n\nFree radicals are unstable molecules that can damage DNA and trigger inflammation.\n\nFree radical damage has been linked to chronic illnesses like cancer, heart disease, and aging. Therefore, eating antioxidant-rich foods is good for your health (6Trusted Source, 7Trusted Source)."}, {"Benefit": "Promote Gut Health", "Description": "The fiber and antioxidants in sweet potatoes are advantageous to gut health.\n\nSweet potatoes contain two types of fiber: soluble and insoluble (8Trusted Source).\n\nYour body cannot digest either type. Therefore, fiber stays within your digestive tract and provides a variety of gut-related health benefits.\n\nCertain types of soluble fiber — known as viscous fibers — absorb water and soften your stool. On the other hand, non-viscous, insoluble fibers don’t absorb water and add bulk (9Trusted Source).\n\nSome soluble and insoluble fibers can also be fermented by the bacteria in your colon, creating compounds called short-chain fatty acids that fuel the cells of your intestinal lining and keep them healthy and strong (10Trusted Source, 11Trusted Source).\n\nFiber-rich diets containing 20–33 grams per day have been linked to a lower risk of colon cancer and more regular bowel movements (12Trusted Source, 13Trusted Source, 14Trusted Source).\n\nThe antioxidants in sweet potatoes may provide gut benefits as well.\n\nTest-tube studies have found that antioxidants in purple sweet potatoes promote the growth of healthy gut bacteria, including certain Bifidobacterium and Lactobacillus species (15Trusted Source, 16Trusted Source).\n\nGreater amounts of these types of bacteria within the intestines are associated with better gut health and a lower risk of conditions like irritable bowel syndrome (IBS) and infectious diarrhea"}, {"Benefit": "May Have Cancer-Fighting Properties", "Description": "Sweet potatoes offer various antioxidants, which may help protect against certain types of cancers.\n\nAnthocyanins — a group of antioxidants found in purple sweet potatoes — have been found to slow the growth of certain types of cancer cells in test-tube studies, including those of the bladder, colon, stomach, and breast (3Trusted Source, 20Trusted Source, 21Trusted Source).\n\nSimilarly, mice fed diets rich in purple sweet potatoes showed lower rates of early-stage colon cancer — suggesting that the anthocyanins in the potatoes may have a protective effect (3Trusted Source, 22Trusted Source).\n\nExtracts of orange sweet potatoes and sweet potato peels have also been found to have anti-cancer properties in test-tube studies (23Trusted Source, 24Trusted Source).\n\nHowever, studies have yet to test these effects in humans"}, {"Benefit": "Support Healthy Vision", "Description": "Sweet potatoes are incredibly rich in beta-carotene, the antioxidant responsible for the vegetable’s bright orange color.\n\nIn fact, one cup (200 grams) of baked orange sweet potato with skin provides more than seven times the amount of beta-carotene that the average adult needs per day (2Trusted Source).\n\nBeta-carotene is converted to vitamin A in your body and used to form light-detecting receptors inside your eyes (25Trusted Source, 26Trusted Source).\n\nSevere vitamin A deficiency is a concern in developing countries and can lead to a special type of blindness known as xerophthalmia. Eating foods rich in beta-carotene, such as orange-fleshed sweet potatoes, may help prevent this condition (27Trusted Source).\n\nPurple sweet potatoes also seem to have vision benefits.\n\nTest-tube studies have found that the anthocyanins they provide can protect eye cells from damage, which may be significant to overall eye health (28Trusted Source)."}, {"Benefit": "May Enhance Brain Function", "Description": "Consuming purple sweet potatoes may improve brain function.\n\nAnimal studies have found that the anthocyanins in purple sweet potatoes can protect the brain by reducing inflammation and preventing free radical damage (29Trusted Source, 30Trusted Source, 31Trusted Source).\n\nSupplementing with anthocyanin-rich sweet potato extract has been shown to improve learning and memory in mice, possibly due to its antioxidant properties (32Trusted Source, 33Trusted Source).\n\nNo studies have been done to test these effects in humans, but in general, diets rich in fruits, vegetables, and antioxidants are associated with a 13% lower risk of mental decline and dementia (34Trusted Source, 35Trusted Source)."}, {"Benefit": "May Support Your Immune System", "Description": "Orange-fleshed sweet potatoes are one of the richest natural sources of beta-carotene, a plant-based compound that is converted to vitamin A in your body (36Trusted Source).\n\nVitamin A is critical to a healthy immune system, and low blood levels have been linked to reduced immunity (37Trusted Source, 38Trusted Source).\n\nIt’s also key for maintaining healthy mucous membranes, especially in the lining of your gut.\n\nThe gut is where your body is exposed to many potential disease-causing pathogens. Therefore, a healthy gut is an important part of a healthy immune system.\n\nStudies have shown that vitamin A deficiency increases gut inflammation and reduces the ability of your immune system to respond properly to potential threats (39Trusted Source).\n\nNo studies have been conducted to determine whether sweet potatoes, in particular, have an effect on immunity, but eating them regularly can help prevent vitamin A deficiency (40Trusted Source)."}]